# Config File for Telegram Bot
# For more info see https://github.com/Syfleshka/NastyaAnnoyingBot

# TARGET = 'kkomilfo'
# TARGET = 'Syfleshek'
TARGETS = ['kkomilfo', 'izhelich']

BOTNAME = 'kkomilfobot'


START_MESSAGE = 'Привет, я тут для того, чтобы помочь Насте учить JavaScript'
HELP_MESSAGE = 'Я живу ради Насти, но если есть какие-то вопросы, можешь задать.\n' \
               'Просто обратись ко мне со своим вопросом. Например:\n' \
               '@kkomilfobot, какая погода сегодня?\n\n' \
               'Ещё можешь использовать слово javascript или js в вопросе, тогда я поищу информацию на learnjs\n'

QUESTIONS = ['как', 'что', 'кто', 'почему']
BORING = ['скучн']
WHY = ['почему?']
JOKE = ['шутк', 'шуто']
KIRKOROV = ['да', 'да.']
KIRKOROVMULTI = ['дадада', 'дадад', 'адада', 'ададад', 'дададад']
TRAKTORIST = ['300', 'триста', 'тристо', 'три сотни']
PIDOR = ['нет', 'нет.']
KIRKOROV_PIDOR = ['да нет', 'да нет.']
ULTRAPIDOR = ['та нет', 'та нет.']
PROMISE = ['ты обещал']
SIGN = ['?']
COOL = [' классный?', ' классная?', ' классное?', ' клёвый?', ' клёвая?', ' клевый?', ' клевая?']
HORO = ['предскажи будущее']
COOL = [' классный?', ' классная?', ' классное?']
WHY_EASY = ['изи', 'та изи']
SMILEY = ['👀']


JS_SEARCH = ['js ', ' js', 'javascript']
